CSI API ETABS v1

# cPropFrameSetColdC_1 Method

---

Initializes a cold formed C-type frame section property. If this function is
called for an existing frame section property, all items for the section are
reset to their default value.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetColdC_1(
    	string Name,
    	string MatProp,
    	double T3,
    	double T2,
    	double Thickness,
    	double Radius,
    	double LipDepth,
    	bool MirrorAbout2,
    	int Color = -1,
    	string Notes = "",
    	string GUID = ""
    )

    Function SetColdC_1 (
    	Name As String,
    	MatProp As String,
    	T3 As Double,
    	T2 As Double,
    	Thickness As Double,
    	Radius As Double,
    	LipDepth As Double,
    	MirrorAbout2 As Boolean,
    	Optional Color As Integer = -1,
    	Optional Notes As String = "",
    	Optional GUID As String = ""
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim MatProp As String
    Dim T3 As Double
    Dim T2 As Double
    Dim Thickness As Double
    Dim Radius As Double
    Dim LipDepth As Double
    Dim MirrorAbout2 As Boolean
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.SetColdC_1(Name,
    	MatProp, T3, T2, Thickness, Radius,
    	LipDepth, MirrorAbout2, Color, Notes,
    	GUID)

    int SetColdC_1(
    	String^ Name,
    	String^ MatProp,
    	double T3,
    	double T2,
    	double Thickness,
    	double Radius,
    	double LipDepth,
    	bool MirrorAbout2,
    	int Color = -1,
    	String^ Notes = L"",
    	String^ GUID = L""
    )

    abstract SetColdC_1 :
            Name : string *
            MatProp : string *
            T3 : float *
            T2 : float *
            Thickness : float *
            Radius : float *
            LipDepth : float *
            MirrorAbout2 : bool *
            ?Color : int *
            ?Notes : string *
            ?GUID : string
    (* Defaults:
            let _Color = defaultArg Color -1
            let _Notes = defaultArg Notes ""
            let _GUID = defaultArg GUID ""
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing or new frame section property. If this is an existing
property, that property is modified; otherwise, a new property is added.

MatProp

    Type: SystemString
The name of the material property for the section.

T3

    Type: SystemDouble

T2

    Type: SystemDouble

Thickness

    Type: SystemDouble
The section thickness. [L]

Radius

    Type: SystemDouble
The corner radius, if any. [L]

LipDepth

    Type: SystemDouble
The lip depth, if any. [L]

MirrorAbout2

    Type: SystemBoolean
Indicates whether the section is mirrored about the local 2-axis.

Color (Optional)

    Type: SystemInt32

Notes (Optional)

    Type: SystemString

GUID (Optional)

    Type: SystemString
The GUID (global unique identifier), if any, assigned to the section. If this
item is input as Default, then the program assigns a GUID to the section.

#### Return Value

Type: Int32
Returns zero if the section property data is successfully retrieved; otherwise
it returns a nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'add cold formed material
           ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_COLDFORMED, , , , MATERIAL_COLDFORMED_SUBTYPE_ASTM_A653SQGr50)

       'set new frame section property
           ret = SapModel.PropFrame.SetColdC_1("CC1", Name, 10, 3.2, 0.08, 0.3, 0.6, False)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com